; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image3 - mode
	spectrograph0 - mode
	infrared2 - mode
	image1 - mode
	Star0 - direction
	Star10 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star9 - direction
	Star12 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation11 - direction
	Star14 - direction
	Star3 - direction
	Star4 - direction
	GroundStation7 - direction
	Star13 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star13)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star14)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 infrared2)
	(supports instrument5 image3)
	(supports instrument5 image1)
	(calibration_target instrument5 Star14)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star3)
	(supports instrument7 image1)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star13)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Phenomenon15 image3)
	(have_image Star16 image1)
	(have_image Star17 infrared2)
	(have_image Phenomenon20 image1)
	(have_image Star21 infrared2)
))

)

; plan
1. (turn_to satellite2 groundstation11 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 groundstation11)
   goals met: 0 of 6
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 6
3. (calibrate satellite2 instrument5 groundstation11)
   added: (calibrated instrument5)
   goals met: 0 of 6
4. (turn_to satellite2 phenomenon20 groundstation11)
   deleted: (pointing satellite2 groundstation11)
   added: (pointing satellite2 phenomenon20)
   goals met: 0 of 6
5. (take_image satellite2 phenomenon20 instrument5 image1)
   added: (have_image phenomenon20 image1)
   goals met: 1 of 6
6. (turn_to satellite2 phenomenon15 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 6
7. (turn_to satellite0 star3 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star3)
   goals met: 2 of 6
8. (take_image satellite2 phenomenon15 instrument5 image3)
   added: (have_image phenomenon15 image3)
   goals met: 3 of 6
9. (turn_to satellite2 star16 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star16)
   goals met: 3 of 6
10. (take_image satellite2 star16 instrument5 image1)
   added: (have_image star16 image1)
   goals met: 4 of 6
11. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 4 of 6
12. (take_image satellite2 star17 instrument5 infrared2)
   added: (have_image star17 infrared2)
   goals met: 5 of 6
13. (turn_to satellite2 star21 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star21)
   goals met: 5 of 6
14. (take_image satellite2 star21 instrument5 infrared2)
   added: (have_image star21 infrared2)
   goals met: 6 of 6
